CSI API ETABS v1
cDStSP16_13330_2011.GetOverwrite Method
 Retrieves the value of a steel design overwrite item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDStSP16_13330_2011
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object with a steel frame design procedure
Item
Type: System.Int32
 This is an integer between 1 and 40, inclusive, indicating the overwrite item considered
Framing type (Not used anymore)
Section class (Not used anymore)
Service factor, GammaC
Safety factor, GammaU
Factor for L-Shapes, GammaC1
Column buckling curve major
Column buckling curve minor
Is rolled section?
Is beam top loaded?
Consider deflection
Deflection check type
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value (Not used anymore)
Total load deflection limit, L/Value
Total-camber limit, L/Value
DL deflection limit, absolute
SDL + LL deflection limit, absolute
LL deflection limit, absolute (Not used anymore)
Total load deflection limit, absolute
Total-camber limit, absolute
Specified camber
Net area to total area ratio
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Unbraced length ratio, LTB
Effective length factor, K1 Major (Not used anymore)
Effective length factor, K1 Minor (Not used anymore)
Effective length factor, K Major
Effective length factor, K Minor
Effective length factor, K LTB
Characteristic strength, Ryn
Design yield strength, Ry
Design fracture strength, Ru
Design shear strength, Rs
Demand/capacity ratio limit
Limit slenderness compression, A
Limit slenderness compression, B
Limit slenderness tension
Value
Type: System.Double
 The value of the considered overwrite item
Framing type (Not used anymore)
Section class (Not used anymore)
Service factor, GammaC
Value >= 0; 0 means use program determined value
Safety factor, GammaU
Value >= 0; 0 means use program determined value
Factor for L-Shapes, GammaC1
Value >= 0; 0 means use program determined value
Column buckling curve major
0 = Program Determined
1 = a
2 = b
3 = c
Column buckling curve minor
0 = Program Determined
1 = a
2 = b
3 = c
Is rolled section?
0 = Program Determined
1 = No
2 = Yes
Is beam top loaded?
0 = Program Determined
1 = No
2 = Yes
Consider deflection?
0 = Program Determined
1 = No
2 = Yes
Deflection check type
0 = Program Determined
1 = Ratio
2 = Absolute
3 = Both
DL deflection limit, L/Value
Value >= 0; 0 means no check for this item
SDL + LL deflection limit, L/Value
Value >= 0; 0 means no check for this item
LL deflection limit, L/Value (Not used anymore)
Total load deflection limit, L/Value
Value >= 0; 0 means no check for this item
Total-camber limit, L/Value
Value >= 0; 0 means no check for this item
DL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
SDL + LL deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
LL deflection limit, absolute (Not used anymore)
Total load deflection limit, absolute
Value >= 0; 0 means no check for this item. [L]
Total-camber limit, absolute
Value >= 0; 0 means no check for this item. [L]
Specified camber
Value >= 0. [L]
Net area to total area ratio
Value >= 0; 0 means use program default value
Live load reduction factor
Value >= 0; 0 means use program determined value
Unbraced length ratio, Major
Value >= 0; 0 means use program determined value
Unbraced length ratio, Minor
Value >= 0; 0 means use program determined value
Unbraced length ratio, LTB
Value >= 0; 0 means use program determined value
Effective length factor, K1 Major (Not used anymore)
Effective length factor, K1 Minor (Not used anymore)
Effective length factor, K Major
Value >= 0; 0 means use program determined value
Effective length factor, K Minor
Value >= 0; 0 means use program determined value
Effective length factor, K LTB
Value >= 0; 0 means use program determined value
Characteristic strength, Ryn
Value >= 0; 0 means use program determined value [F/L2]
Design yield strength, Ry
Value >= 0; 0 means use program determined value [F/L2]
Design fracture strength, Ru
Value >= 0; 0 means use program determined value [F/L2]
Design shear strength, Rs
Value >= 0; 0 means use program determined value [F/L2]
Demand/capacity ratio limit
Value >= 0; 0 means use program determined value
Limit slenderness compression, A
Value >= 0; 0 means use program determined value
Limit slenderness compression, B
Value >= 0; 0 means use program determined value
Limit slenderness tension
Value >= 0; 0 means use program determined value
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("SP 16.13330.2011")
'get overwrite item
   ret = SapModel.DesignSteel.SP16_13330_2011.GetOverwrite("8", 1, Value, ProgDet)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStSP16_13330_2011 Interface
ETABSv1 Namespace